<?xml version="1.0" encoding="utf-8"?>
<!--
Author: Florian Stosse <florian.stosse@gmail.com>
Version: 1.1.1
Date: 2024-12-08
-->
<policyDefinitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
	<policyNamespaces>
		<target prefix="AddHard" namespace="AddHard.Policies.AddHard" />
	</policyNamespaces>
	<resources minRequiredRevision="1.0" />
	<categories>
		<!-- Main categories -->
		<category name="Cat_AddHard" displayName="$(string.Cat_AddHard)" />
		<category name="Cat_Debug" displayName="$(string.Cat_Debug)" />
		<category name="Cat_MSFT" displayName="$(string.Cat_MSFT)" />
		<category name="Cat_Legacy" displayName="$(string.Cat_Legacy)" />
	</categories>
</policyDefinitions>
