<?xml version="1.0" encoding="utf-8"?>
<policyDefinitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
    <policyNamespaces>
        <target prefix="AddMSFTHard" namespace="AddSystemHard.Policies.AddMSFTHard" />
        <using prefix="windows" namespace="Microsoft.Policies.Windows" />
        <using prefix="parent" namespace="AddHard.Policies.AddHard" />
    </policyNamespaces>
    <resources minRequiredRevision="1.0" />
    <supportedOn>
        <definitions>
            <definition name="SUPPORTED_WindowsServer2008AndNewer" displayName="$(string.SUPPORTED_WindowsServer2008AndNewer)" />
        </definitions>
    </supportedOn>
    <policies>
        <!-- Configure SMBv1 -->
        <policy name="Pol_SecGuide_0001_SMBv1_Server" class="Machine" displayName="$(string.Pol_SecGuide_SMBv1Server)" explainText="$(string.Pol_SecGuide_SMBv1Server_Help)" key="SYSTEM\CurrentControlSet\Services\LanmanServer\Parameters" valueName="SMB1">
            <parentCategory ref="parent:Cat_MSFT" />
            <supportedOn ref="windows:SUPPORTED_Windows7" />
            <enabledValue>
                <decimal value="1" />
            </enabledValue>
            <disabledValue>
                <decimal value="0" />
            </disabledValue>
        </policy>
        <policy name="Pol_SecGuide_0002_SMBv1_ClientDriver" class="Machine" displayName="$(string.Pol_SecGuide_SMBv1ClientDriver)" explainText="$(string.Pol_SecGuide_SMBv1ClientDriver_Help)" key="SYSTEM\CurrentControlSet\Services\MrxSmb10" presentation="$(presentation.Pol_SecGuide_SMBv1ClientDriver)">
            <parentCategory ref="parent:Cat_MSFT" />
            <supportedOn ref="windows:SUPPORTED_Windows7" />
            <elements>
                <enum id="Pol_SecGuide_SMB1ClientDriver" key="SYSTEM\CurrentControlSet\Services\MrxSmb10" valueName="Start">
                    <item displayName="$(string.SMB1DriverDisable)">
                        <value>
                            <decimal value="4" />
                        </value>
                    </item>
                    <item displayName="$(string.SMB1DriverManualStart)">
                        <value>
                            <decimal value="3" />
                        </value>
                    </item>
                    <item displayName="$(string.SMB1DriverAutomaticStart)">
                        <value>
                            <decimal value="2" />
                        </value>
                    </item>
                </enum>
            </elements>
        </policy>
        <!-- NetBT NodeType configuration -->
        <policy name="Pol_SecGuide_0050_NetbtNodeTypeConfig" class="Machine" displayName="$(string.Pol_SecGuide_NetbtNodeTypeCfg)" explainText="$(string.Pol_SecGuide_NetbtNodeTypeCfg_Help)" key="SYSTEM\CurrentControlSet\Services\NetBT\Parameters" presentation="$(presentation.Pol_SecGuide_NetbtNodeTypeCfg)">
            <parentCategory ref="parent:Cat_MSFT" />
            <supportedOn ref="windows:SUPPORTED_Windows7" />
            <elements>
                <enum id="Pol_SecGuide_SecGuide_NetbtNodeTypeCfg" key="SYSTEM\CurrentControlSet\Services\NetBT\Parameters" valueName="NodeType">
                    <item displayName="$(string.NetBtNodeTypeB)">
                        <value>
                            <decimal value="1" />
                        </value>
                    </item>
                    <item displayName="$(string.NetBtNodeTypeP)">
                        <value>
                            <decimal value="2" />
                        </value>
                    </item>
                    <item displayName="$(string.NetBtNodeTypeM)">
                        <value>
                            <decimal value="4" />
                        </value>
                    </item>
                    <item displayName="$(string.NetBtNodeTypeH)">
                        <value>
                            <decimal value="8" />
                        </value>
                    </item>
                </enum>
            </elements>
        </policy>
        <!-- SEHOP -->
        <policy name="Pol_SecGuide_0102_SEHOP" class="Machine" displayName="$(string.Pol_SecGuide_SEHOP)" explainText="$(string.Pol_SecGuide_SEHOP_Help)" key="SYSTEM\CurrentControlSet\Control\Session Manager\kernel" valueName="DisableExceptionChainValidation">
            <parentCategory ref="parent:Cat_MSFT" />
            <supportedOn ref="windows:SUPPORTED_WindowsVista" />
            <enabledValue>
                <decimal value="0" />
            </enabledValue>
            <disabledValue>
                <decimal value="1" />
            </disabledValue>
        </policy>
        <!-- Credential theft protections -->
        <policy name="Pol_SecGuide_0201_LATFP" class="Machine" displayName="$(string.Pol_SecGuide_LATFP)" explainText="$(string.Pol_SecGuide_LATFP_Help)" key="SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System" valueName="LocalAccountTokenFilterPolicy">
            <parentCategory ref="parent:Cat_MSFT" />
            <supportedOn ref="windows:SUPPORTED_WindowsVista" />
            <enabledValue>
                <decimal value="0" />
            </enabledValue>
            <disabledValue>
                <decimal value="1" />
            </disabledValue>
        </policy>
        <policy name="Pol_SecGuide_0202_WDigestAuthn" class="Machine" displayName="$(string.Pol_SecGuide_WDigestAuthn)" explainText="$(string.Pol_SecGuide_WDigestAuthn_Help)" key="SYSTEM\CurrentControlSet\Control\SecurityProviders\WDigest" valueName="UseLogonCredential">
            <parentCategory ref="parent:Cat_MSFT" />
            <supportedOn ref="windows:SUPPORTED_Windows7" />
            <enabledValue>
                <decimal value="1" />
            </enabledValue>
            <disabledValue>
                <decimal value="0" />
            </disabledValue>
        </policy>
        <policy name="Pol_SecGuide_0203_LsassAudit" class="Machine" displayName="$(string.Pol_SecGuide_LsassAudit)" explainText="$(string.Pol_SecGuide_LsassAudit_Help)" key="SOFTWARE\Microsoft\Windows NT\CurrentVersion\Image File Execution Options\LSASS.exe" valueName="AuditLevel">
            <parentCategory ref="parent:Cat_MSFT" />
            <supportedOn ref="windows:SUPPORTED_Windows_6_3" />
            <enabledValue>
                <decimal value="8" />
            </enabledValue>
            <disabledValue>
                <decimal value="0" />
            </disabledValue>
        </policy>
        <policy name="Pol_SecGuide_0204_LsassRunAsPPL" class="Machine" displayName="$(string.Pol_SecGuide_LsassRunAsPPL)" explainText="$(string.Pol_SecGuide_LsassRunAsPPL_Help)" key="SYSTEM\CurrentControlSet\Control\Lsa" valueName="RunAsPPL">
            <parentCategory ref="parent:Cat_MSFT" />
            <supportedOn ref="windows:SUPPORTED_Windows_6_3" />
            <enabledValue>
                <decimal value="1" />
            </enabledValue>
            <disabledValue>
                <decimal value="0" />
            </disabledValue>
        </policy>
        <!-- Disable same-desktop credential exposure -->
        <policy name="Pol_SecGuide_0301_RemoveRunasdifferentuser" class="Machine" displayName="$(string.Pol_SecGuide_RemoveRunasdifferentuser)" explainText="$(string.Pol_SecGuide_RemoveRunasdifferentuser_Help)" key="SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer">
            <parentCategory ref="parent:Cat_MSFT" />
            <supportedOn ref="windows:SUPPORTED_WindowsVista" />
            <enabledList>
                <item key="SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer" valueName="NoStartBanner">
                    <value>
                        <decimal value="1" />
                    </value>
                </item>
                <item key="SOFTWARE\Classes\batfile\shell\runasuser" valueName="SuppressionPolicy">
                    <value>
                        <!-- 4096 == 0x1000 == REST_STARTBANNER -->
                        <decimal value="4096" />
                    </value>
                </item>
                <item key="SOFTWARE\Classes\cmdfile\shell\runasuser" valueName="SuppressionPolicy">
                    <value>
                        <!-- 4096 == 0x1000 == REST_STARTBANNER -->
                        <decimal value="4096" />
                    </value>
                </item>
                <item key="SOFTWARE\Classes\exefile\shell\runasuser" valueName="SuppressionPolicy">
                    <value>
                        <!-- 4096 == 0x1000 == REST_STARTBANNER -->
                        <decimal value="4096" />
                    </value>
                </item>
                <item key="SOFTWARE\Classes\mscfile\shell\runasuser" valueName="SuppressionPolicy">
                    <value>
                        <!-- 4096 == 0x1000 == REST_STARTBANNER -->
                        <decimal value="4096" />
                    </value>
                </item>
            </enabledList>
            <disabledList>
                <item key="SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer" valueName="NoStartBanner">
                    <value>
                        <delete />
                    </value>
                </item>
                <item key="SOFTWARE\Classes\batfile\shell\runasuser" valueName="SuppressionPolicy">
                    <value>
                        <delete />
                    </value>
                </item>
                <item key="SOFTWARE\Classes\cmdfile\shell\runasuser" valueName="SuppressionPolicy">
                    <value>
                        <delete />
                    </value>
                </item>
                <item key="SOFTWARE\Classes\exefile\shell\runasuser" valueName="SuppressionPolicy">
                    <value>
                        <delete />
                    </value>
                </item>
                <item key="SOFTWARE\Classes\mscfile\shell\runasuser" valueName="SuppressionPolicy">
                    <value>
                        <delete />
                    </value>
                </item>
            </disabledList>
        </policy>
        <!-- Block Flash in Office documents using Office "kill bit" feature -->
        <policy name="Pol_SecGuide_A001_Block_Flash" class="Machine" Area="Security Baseline" AreaCategory="Jscript and VBScript" displayName="$(string.Pol_SecGuide_Block_Flash)" explainText="$(string.Pol_SecGuide_Block_Flash_Help)" presentation="$(presentation.Pol_SecGuide_Block_Flash)" key="SOFTWARE\Microsoft\Office\Common\COM Compatibility">
            <parentCategory ref="parent:Cat_MSFT" />
            <supportedOn ref="windows:SUPPORTED_Windows7" />
            <elements>
                <enum id="Pol_SecGuide_Block_Flash" key="SOFTWARE\Microsoft\Office\Common\COM Compatibility" valueName="Comment">
                    <item displayName="$(string.BlockFlash_BlockActivation)">
                        <value>
                            <string>
								Block all Flash activation
							</string>
                        </value>
                        <valueList>
                            <item key="SOFTWARE\Microsoft\Office\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="0" />
                                </value>
                            </item>
                            <item key="SOFTWARE\Microsoft\Office\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="1024" />
                                    <!-- hex 400 -->
                                </value>
                            </item>
                            <item key="SOFTWARE\Microsoft\Office\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="0" />
                                </value>
                            </item>
                            <item key="SOFTWARE\Microsoft\Office\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="1024" />
                                    <!-- hex 400 -->
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="0" />
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="1024" />
                                    <!-- hex 400 -->
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="0" />
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="1024" />
                                    <!-- hex 400 -->
                                </value>
                            </item>
                            <item key="SOFTWARE\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="0" />
                                </value>
                            </item>
                            <item key="SOFTWARE\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="1024" />
                                    <!-- hex 400 -->
                                </value>
                            </item>
                            <item key="SOFTWARE\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="0" />
                                </value>
                            </item>
                            <item key="SOFTWARE\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="1024" />
                                    <!-- hex 400 -->
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="0" />
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="1024" />
                                    <!-- hex 400 -->
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="0" />
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="1024" />
                                    <!-- hex 400 -->
                                </value>
                            </item>
                        </valueList>
                    </item>
                    <item displayName="$(string.BlockFlash_BlockEmbedded)">
                        <value>
                            <string>
								Block embedded Flash activation only
							</string>
                        </value>
                        <valueList>
                            <item key="SOFTWARE\Microsoft\Office\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="1" />
                                </value>
                            </item>
                            <item key="SOFTWARE\Microsoft\Office\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="1024" />
                                    <!-- hex 400 -->
                                </value>
                            </item>
                            <item key="SOFTWARE\Microsoft\Office\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="1" />
                                </value>
                            </item>
                            <item key="SOFTWARE\Microsoft\Office\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="1024" />
                                    <!-- hex 400 -->
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="1" />
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="1024" />
                                    <!-- hex 400 -->
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="1" />
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="1024" />
                                    <!-- hex 400 -->
                                </value>
                            </item>
                            <item key="SOFTWARE\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="1" />
                                </value>
                            </item>
                            <item key="SOFTWARE\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="1024" />
                                    <!-- hex 400 -->
                                </value>
                            </item>
                            <item key="SOFTWARE\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="1" />
                                </value>
                            </item>
                            <item key="SOFTWARE\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="1024" />
                                    <!-- hex 400 -->
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="1" />
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="1024" />
                                    <!-- hex 400 -->
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="1" />
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="1024" />
                                    <!-- hex 400 -->
                                </value>
                            </item>
                        </valueList>
                    </item>
                    <item displayName="$(string.BlockFlash_AllowAll)">
                        <value>
                            <string>
								Allow all Flash activation
							</string>
                        </value>
                        <valueList>
                            <item key="SOFTWARE\Microsoft\Office\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="1" />
                                </value>
                            </item>
                            <item key="SOFTWARE\Microsoft\Office\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="0" />
                                </value>
                            </item>
                            <item key="SOFTWARE\Microsoft\Office\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="1" />
                                </value>
                            </item>
                            <item key="SOFTWARE\Microsoft\Office\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="0" />
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="1" />
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="0" />
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="1" />
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="0" />
                                </value>
                            </item>
                            <item key="SOFTWARE\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="1" />
                                </value>
                            </item>
                            <item key="SOFTWARE\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="0" />
                                </value>
                            </item>
                            <item key="SOFTWARE\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="1" />
                                </value>
                            </item>
                            <item key="SOFTWARE\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="0" />
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="1" />
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB6E-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="0" />
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="ActivationFilterOverride">
                                <value>
                                    <decimal value="1" />
                                </value>
                            </item>
                            <item key="SOFTWARE\WOW6432Node\Microsoft\Office\16.0\Common\COM Compatibility\{D27CDB70-AE6D-11CF-96B8-444553540000}" valueName="Compatibility Flags">
                                <value>
                                    <decimal value="0" />
                                </value>
                            </item>
                        </valueList>
                    </item>
                </enum>
            </elements>
        </policy>
        <!-- Legacy JScript Block for Internet Explorer -->
        <policy name="Pol_SecGuide_Legacy_JScript" class="Machine" Area="Security Baseline" AreaCategory="Jscript and VBScript" displayName="$(string.Pol_SecGuide_Legacy_JScript)" explainText="$(string.Pol_SecGuide_Legacy_JScript_Help)" key="software\policies\microsoft\internet explorer\main\featurecontrol\FEATURE_RESTRICT_LEGACY_JSCRIPT_PER_SECURITY_ZONE" presentation="$(presentation.Pol_SecGuide_Legacy_JScript)">
            <parentCategory ref="parent:Cat_MSFT" />
            <supportedOn ref="windows:SUPPORTED_Windows_10_0_RS4" />
            <elements>
                <decimal id="POL_SG_excel" valueName="excel.exe" maxValue="99999" storeAsText="false" />
                <decimal id="POL_SG_mspub" valueName="mspub.exe" maxValue="99999" storeAsText="false" />
                <decimal id="POL_SG_powerpnt" valueName="powerpnt.exe" maxValue="99999" storeAsText="false" />
                <decimal id="POL_SG_onenote" valueName="onenote.exe" maxValue="99999" storeAsText="false" />
                <decimal id="POL_SG_visio" valueName="visio.exe" maxValue="99999" storeAsText="false" />
                <decimal id="POL_SG_winproj" valueName="winproj.exe" maxValue="99999" storeAsText="false" />
                <decimal id="POL_SG_winword" valueName="winword.exe" maxValue="99999" storeAsText="false" />
                <decimal id="POL_SG_outlook" valueName="outlook.exe" maxValue="99999" storeAsText="false" />
                <decimal id="POL_SG_msaccess" valueName="msaccess.exe" maxValue="99999" storeAsText="false" />
            </elements>
        </policy>
        <!-- Configure Incoming Print RPC Listeners Auth Setting -->
        <policy name="Pol_SecGuide_RpcIncomingAuthenticationLevelPolicy" class="Machine" displayName="$(string.Pol_SecGuide_RpcIncomingAuthenticationLevelPolicy)" explainText="$(string.Pol_SecGuide_RpcIncomingAuthenticationLevelPolicy_Help)" key="SYSTEM\CurrentControlSet\Control\Print" valueName="RpcAuthnLevelPrivacyEnabled">
            <parentCategory ref="parent:Cat_MSFT" />
            <supportedOn ref="windows:SUPPORTED_Windows_10_0" />
            <enabledValue>
                <decimal value="1" />
            </enabledValue>
            <disabledValue>
                <decimal value="0" />
            </disabledValue>
        </policy>
        <!-- Block NTLMv1 -->
        <policy name="Pol_SecGuide_BlockNtlmV1" class="Machine" displayName="$(string.Pol_SecGuide_BlockNtlmV1)" explainText="$(string.Pol_SecGuide_BlockNtlmV1_Help)" presentation="$(presentation.Pol_SecGuide_BlockNtlmV1)" key="SYSTEM\CurrentControlSet\Control\Lsa\MSV1_0">
            <parentCategory ref="parent:Cat_MSFT" />
            <supportedOn ref="windows:SUPPORTED_Windows_10_0" />
            <elements>
                <enum id="Pol_SecGuide_BlockNtlmV1_Enum" valueName="BlockNtlmv1SSO">
                    <item displayName="$(string.BlockNtlmV1_Audit)">
                        <value>
                            <decimal value="0" />
                        </value>
                    </item>
                    <item displayName="$(string.BlockNtlmV1_Enforce)">
                        <value>
                            <decimal value="1" />
                        </value>
                    </item>
                </enum>
            </elements>
        </policy>
    </policies>
</policyDefinitions>
